DataProcessors/ВыгрузкаВАвтотеку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаВАвтотеку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Привод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Привод</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Передний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заднеприводный_с_подключаемым_передним</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный_подключаемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный_привод_на_все_колеса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРемонта</Name>
			<Comment>Типы ремонта (платный/бесплатный)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платный</Name>
					<Comment>Ремонт платный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесплатный</Name>
					<Comment>Ремонт бесплатный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматТекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФорматТекста</Name>
			<Comment>Тип текста HTML или Простой текст</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
					<Comment>Формат текста HTML </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<Comment>Текстовый формат </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаВАвтотеку/Ext/ObjectModule.bsl
Перем СписокФайлов Экспорт;
Перем СтруктураLocation;

Процедура ВыполнитьОбработку(ДляAutoru = Ложь) Экспорт
	Если НЕ ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		// тестовый сервер
		//НачалоПериода = НачалоДня(Дата(2020, 07, 20));
		//КонецПериода = КонецДня(Дата(2020, 07, 20));
		
		// рабочий сервер
		НачалоПериода = НачалоДня(НачалоДня(ТекущаяДата())-1);
		КонецПериода = КонецДня(НачалоПериода);		
		ЭтоРегЗадание = Истина;
	Иначе
		КонецПериода = КонецДня(КонецПериода);
		ЭтоРегЗадание = Ложь;
	КонецЕсли;
	
	// Группы подразделений для выгрузки
	СписокПодразделений = Новый Массив();
	
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000117")); // Авто Лига (SUZUKI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001241")); // Шолохова 235 (АСП)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001285")); // Шахты Джили (GEELY)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000189")); // Волгодонск Лада (LADA)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000190")); // Волгодонск Ниссан (NISSAN)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000191")); // Волгодонск Рено (RENAULT, SUZUKI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001185")); // Волгодонск Автосейл (JAC)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001181")); // Гамма Шолохова (JEEP,GAC,FIAT)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001166")); // Дельта Моторс (HYUNDAI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001167")); // Евро Кар (Доватора) (JAC,UAZ)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001160")); // Олимп Моторс (Шахты) (JAC,NISSAN,OMODA)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000223")); // Пойменная Сокол Моторс (EXEED)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000099")); // Рассвет (LADA)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000149")); // Шахты Рено (RENAULT, SUZUKI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000260")); // Малиновского 17в  (CHANGAN)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001221")); // Шахты Хендэ (HYUNDAI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001506")); // Шолохова 237 (CHANGAN)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001511")); // Шолохова 237 (KAIYI)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001521")); // Шолохова 237 (BAIC)
	СписокПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001499")); // Шолохова 235->237 (UAZ, JAC)
	
	Для Каждого Подразделение Из СписокПодразделений Цикл
		Если ДляAutoru Тогда
			ВыгрузитьДанныеДляAutoru(Подразделение, ЭтоРегЗадание);
		Иначе
			ВыгрузитьДанныеПоПодразделению(Подразделение, ЭтоРегЗадание);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеПоПодразделению(Подразделение, ЭтоРегЗадание)	
	Город = ПолучитьГородПодразделения(Подразделение);	
	Если НЕ ЗначениеЗаполнено(Город) Тогда
		ВыводСообщения = "Не удалось получить город подразделения " + Подразделение.Наименование + "!";
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ПолучитьГородПодразделения", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураLocation = ПолучитьСтруктуруLocation(Подразделение);
	
	СписокФайлов.Очистить();
	ПолучитьДанныеПродажиАвто(Подразделение);
	ПолучитьДанныеПоРемонтуОбслуживаниюАвто(Подразделение);
	ПолучитьДанныеПоУстановкеДопОборудования(Подразделение);
	
	СтрокаФайлы = "";
	Для Каждого Эл Из СписокФайлов Цикл
		СтрокаФайлы = СтрокаФайлы + Эл.Значение + " ";
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(СтрокаФайлы) Тогда
		ВыводСообщения = "Отсутствуют файлы для отправки (" + Подразделение.Наименование + ")!";
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Предупреждение, , ,ВыводСообщения);
		Возврат;
	КонецЕсли;
	
	ФайлСкрипта = КаталогВременныхФайлов()+"myscript.scr";
	
	ДокСкрипт = Новый ТекстовыйДокумент;
	ДокСкрипт.ДобавитьСтроку("cd /pub");
	ДокСкрипт.ДобавитьСтроку("mput " + СтрокаФайлы);
	ДокСкрипт.ДобавитьСтроку("exit");
	ДокСкрипт.Записать(ФайлСкрипта,"CESU-8"); // = utf-8 без Byte Order Mask
	
	#Если Клиент Тогда
	Сообщить("Создан файл сценария: " + ФайлСкрипта);
	#КонецЕсли

	// тестовый сервер
	//psftp   = """C:\Program Files (x86)\PuTTY\psftp""";
	//Server  = "fpbx15.sokolmotors.lan";
	//Port    = "22";
	//Login   = "test-autoteka";
	//Pass    = "Gfhjkm123";
	//hostkey = """ssh-rsa 2048 c8:de:79:7b:3b:43:df:5f:af:73:53:73:47:70:dd:46""";
	
	//рабочий сервер
	psftp   = """C:\Program Files\PuTTY\psftp.exe""";
	Server  = "roadstore.avito.ru";
	Port    = "522";
	Login   = "sokol-motors";
	Pass    = "RWfVzuszurLj";
	//hostkey = """ssh-ed25519 255 bb:1a:74:cb:28:6a:03:14:f8:61:11:18:f3:23:2b:a8""";
	hostkey = """ssh-ed25519 256 df:14:de:e5:71:34:d1:71:44:a6:47:9c:e4:6d:35:18""";
	
	Попытка
		WshShell = Новый COMОбъект("WScript.Shell");
	Исключение
		Сообщить("Не удалось инициализировать WScript.Shell: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	КоманднаяСтрока = psftp + " " + Server + " -P " + Port
			+ " -l " + Login + " -pw " + Pass + " -hostkey " + hostkey + " -b " + ФайлСкрипта;
	Попытка		
		Если ЭтоРегЗадание Тогда
			КодВозврата = WshShell.Run(КоманднаяСтрока, 0, Истина);
		Иначе
			КодВозврата = WshShell.Run(КоманднаяСтрока, 1, Истина);
			//КоманднаяСтрока = "C:\Program Files (x86)\PuTTY\psftp " + Server + " -P " + Port + " -l " + Login + " -pw " + Pass + " -b " + ФайлСкрипта;
			//ЗапуститьПриложение(КоманднаяСтрока);
		КонецЕсли;

	Исключение
		ВыводСообщения = "Ошибка при отправке по SFTP (" + Подразделение.Наименование + "): " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		#Если Клиент Тогда
		Сообщить(ВыводСообщения, СтатусСообщения.Внимание);
		#КонецЕсли
		WshShell = Неопределено;
		Возврат;
	КонецПопытки;
	
	WshShell = Неопределено;
	Для Каждого ИмяВремФайла Из СписокФайлов Цикл
		Файл = Новый Файл(ИмяВремФайла.Значение);
		Если Файл.Существует() Тогда
			Попытка
				УдалитьФайлы(ИмяВремФайла.Значение);
			Исключение
			КонецПопытки;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьГородПодразделения(Подразделение)
	
	//Получим город подразделения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4 КАК Город
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид
	|	И КонтактнаяИнформация.Объект = &ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ГородСобытия = СтрЗаменить(Выборка.Город," г","");
	Иначе
		ГородСобытия = "";
	КонецЕсли;
	
	Возврат ГородСобытия;
	
КонецФункции

Процедура ПолучитьДанныеПоРемонтуОбслуживаниюАвто(Подразделение, ДляAutoru = Ложь)
	МассивСтруктур = Новый Массив;
	
	СписокВидовРемонта = Новый СписокЗначений;
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойКоммерческий);
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойРемонт);
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ДиагностикаТрейдИн);
 	//Бондаренко++ 20200807
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживание); //Техническое обслуживание
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.КоммерческийРемонт);      //Коммерческий ремонт
	//Бондаренко-- 20200807
	
	СписокКузовнойРемонт = Новый СписокЗначений;
	СписокКузовнойРемонт.Добавить(Справочники.ВидыРемонта.КузовнойРемонт);
	СписокКузовнойРемонт.Добавить(Справочники.ВидыРемонта.КузовнойКоммерческий);
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ГруппаПодразделений", Подразделение);
	Запрос.УстановитьПараметр("СостояниеЗакрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("СписокВидовРемонта", СписокВидовРемонта);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка,
	|	ЗаказНаряд.Дата КАК ДатаСобытия,
	|	ЗаказНаряд.Номер КАК НомерДокумента,
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Автомобиль.Модель.Марка КАК Марка,
	|	ЗаказНаряд.Автомобиль.Модель.НаименованиеМодели_Аш_Промис КАК Модель_Аш_Промис,
	|	ЗаказНаряд.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.Цвет) КАК Цвет,
	|	ЗаказНаряд.Автомобиль.Привод КАК Привод,
	|	ЗаказНаряд.Автомобиль.МощностьДвигателя КАК МощностьДвигателя,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.Автомобиль.ОбъемДвигателя = 0
	|			ТОГДА ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя
	|		ИНАЧЕ ЗаказНаряд.Автомобиль.ОбъемДвигателя
	|	КОНЕЦ КАК ОбъемДвигателя,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.Автомобиль.ТипКПП <> ЗНАЧЕНИЕ(Справочник.ТипыКПП.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ТипКПП)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипКПП)
	|	КОНЕЦ КАК ТипКПП,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ТипДвигателя.ТипТоплива), ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива)) КАК ТипДвигателя,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.Автомобиль.ГодВыпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ГОД(ЗаказНаряд.Автомобиль.ГодВыпуска)
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ГодВыпуска,
	|	ЗаказНаряд.Автомобиль.VIN КАК ВИН,
	|	ЗаказНаряд.Пробег,
	|	ЗаказНаряд.ВидРемонта,
	|	ЗаказНаряд.ВидРемонта.ТипРемонта КАК ТипРемонта,
	|	ЗаказНаряд.ВидРемонта.ГарантияЗавода КАК ГарантияЗавода,
	|	ЗаказНаряд.ВидРемонта.ТехОбслуживание КАК ТО,
	|	ЗаказНаряд.НомерНаправленияСК,
	|	ЗаказНаряд.ДатаНаправленияСК,
	|	ЗаказНаряд.ПричинаОбращения,
	|	ЗаказНаряд.СервиснаяКампания.Наименование КАК СервиснаяКампания
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаказНаряд.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
	|	И ЗаказНаряд.Состояние = &СостояниеЗакрыт
	|	И ЗаказНаряд.ВидРемонта В(&СписокВидовРемонта)
	|	И ЗаказНаряд.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ЗаказНарядРаботы.Ссылка
	|			ИЗ
	|				Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|			ГДЕ
	|				ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании В ИЕРАРХИИ (&ГруппаПодразделений)
	|				И ЗаказНарядРаботы.Ссылка.ВидРемонта В (&СписокВидовРемонта)
	|				И ЗаказНарядРаботы.Ссылка.Состояние = &СостояниеЗакрыт)
	|	И НЕ(ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""I%""
	|				ИЛИ ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""O%""
	|				ИЛИ ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""Q%"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаряд.Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВозврата = Новый Структура();
		
		ГодСобытия = Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy");
		ИдСобытия = ГодСобытия + "_" + ВыборкаДетальныеЗаписи.НомерДокумента;
		СтруктураВозврата.Вставить("id",ИдСобытия);
		СтруктураВозврата.Вставить("et",2);
		СтруктураВозврата.Вставить("v",ВыборкаДетальныеЗаписи.ВИН);
		СтруктураВозврата.Вставить("dt",Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy-MM-dd"));
		СтруктураВозврата.Вставить("er","Ростовская область");
		Если СтруктураLocation <> Неопределено Тогда
			СтруктураВозврата.Вставить("location",СтруктураLocation);
		КонецЕсли;
		СтруктураВозврата.Вставить("ec", Город);
		СтруктураВозврата.Вставить("m", ВыборкаДетальныеЗаписи.Пробег);
		
		////Далее все необязательные, передаем null  //В 1С null передавать нельзя , выдает ошибку
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Марка) Тогда
			СтруктураВозврата.Вставить("cbrand",ТРег(ВыборкаДетальныеЗаписи.Марка));
		Иначе
			СтруктураВозврата.Вставить("cbrand","");
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Модель_Аш_Промис) Тогда
			СтруктураВозврата.Вставить("cmodel",ВыборкаДетальныеЗаписи.Модель_Аш_Промис);
		Иначе
			СтруктураВозврата.Вставить("cmodel","");
		КонецЕсли;

		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВариантКомплектации) Тогда
			СтруктураВозврата.Вставить("cdetails",СокрЛП(ВыборкаДетальныеЗаписи.ВариантКомплектации));	
		КонецЕсли;

		//СтруктураВозврата.Вставить("cdescr",null);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГодВыпуска) Тогда
			СтруктураВозврата.Вставить("y",ВыборкаДетальныеЗаписи.ГодВыпуска);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОбъемДвигателя) Тогда
			ОбъемДвигателя = ВыборкаДетальныеЗаписи.ОбъемДвигателя;
			Если ВыборкаДетальныеЗаписи.ОбъемДвигателя < 10 Тогда
				ОбъемДвигателя = ОбъемДвигателя*1000;
			КонецЕсли;
			СтруктураВозврата.Вставить("cengs",ОбъемДвигателя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МощностьДвигателя) Тогда
			СтруктураВозврата.Вставить("chp",ВыборкаДетальныеЗаписи.МощностьДвигателя);  
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДвигателя) Тогда
			ТипДвигателя = "";
			Если ВыборкаДетальныеЗаписи.ТипДвигателя = "Бензин" Тогда
				ТипДвигателя = "petrol";
			ИначеЕсли ВыборкаДетальныеЗаписи.ТипДвигателя = "Дизельное топливо" Тогда
				ТипДвигателя = "diesel";
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипДвигателя) Тогда
				СтруктураВозврата.Вставить("cengt",ТипДвигателя);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цвет) Тогда
		    СтруктураВозврата.Вставить("ccolor",ТРег(ВыборкаДетальныеЗаписи.Цвет));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Привод) Тогда
			Если ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Передний Тогда
				СтруктураВозврата.Вставить("cdrive","front");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Полный Тогда
				СтруктураВозврата.Вставить("cdrive","full");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Задний Тогда
				СтруктураВозврата.Вставить("cdrive","back");
			КонецЕсли;
		КонецЕсли;
		//СтруктураВозврата.Вставить("csw",null);
		//СтруктураВозврата.Вставить("clnttp",null);  //НЕ ПЕРЕДАВАТЬ!
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипКПП) Тогда
			Если ВыборкаДетальныеЗаписи.ТипКПП = "Автомат" Тогда
				СтруктураВозврата.Вставить("ctrans","automatic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Механика" Тогда
				СтруктураВозврата.Вставить("ctrans","manual");
            ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Робот" Тогда
				СтруктураВозврата.Вставить("ctrans","robotic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Вариатор" Тогда
				СтруктураВозврата.Вставить("ctrans","variator");
			КонецЕсли;
		КонецЕсли;
		
		//СтруктураВозврата.Вставить("isplan",null);
		
		Если ВыборкаДетальныеЗаписи.ГарантияЗавода Тогда
			СтруктураВозврата.Вставить("type","guaranty");
		ИначеЕсли СписокКузовнойРемонт.НайтиПоЗначению(ВыборкаДетальныеЗаписи.ВидРемонта)<> Неопределено Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерНаправленияСК) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНаправленияСК) Тогда
				СтруктураВозврата.Вставить("type","body_insurance");
			Иначе
				СтруктураВозврата.Вставить("type","body_paid");
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.ТО Тогда
			СтруктураВозврата.Вставить("type","regulation");
		Иначе     //текущий ремонт
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерНаправленияСК) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНаправленияСК) Тогда
				СтруктураВозврата.Вставить("type","ordinary_insurance");
			Иначе
				Если ВыборкаДетальныеЗаписи.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
					СтруктураВозврата.Вставить("type","ordinary_dealer");		
				Иначе
					СтруктураВозврата.Вставить("type","ordinary_paid");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; //СтруктураВозврата("type")
		
		ОписаниеРабот = "";
		
		Для Каждого стр Из ВыборкаДетальныеЗаписи.Ссылка.Работы Цикл
			
			СвойствоНеВыгружать = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("ПШК55");
			Если обПолучитьЗначениеСвойства(стр.Работа,СвойствоНеВыгружать,Ложь) Тогда
				Продолжить;
			КонецЕсли;
			
			ВыполненнаяРабота = стр.Работа.НаименованиеПолное;
			Если СокрЛП(ВыполненнаяРабота) = "Замена" Тогда
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СервиснаяКампания) Тогда
					ВыполненнаяРабота = "Сервисная кампания:" + ВыборкаДетальныеЗаписи.СервиснаяКампания;
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПричинаОбращения) Тогда
					ВыполненнаяРабота = ВыборкаДетальныеЗаписи.ПричинаОбращения;
				КонецЕсли;
			КонецЕсли;
			
			ОписаниеРабот = ОписаниеРабот + ВыполненнаяРабота + "; ";
		КонецЦикла;
		
		СтруктураВозврата.Вставить("det",ОписаниеРабот);
		
		МассивСтруктур.Добавить(СтруктураВозврата);
		
	КонецЦикла;
	
	ВремяФормирования = Формат(ТекущаяДата(),"ДФ=ггггММдд-ЧЧммсс");	
	ПодразделениеКод = смсКоммуникатор.Транслитерация(Подразделение.Код);	
	Если ДляAutoru Тогда
		ИмяФайла = ПодразделениеКод + "_2_" + ВремяФормирования + ".json";
	Иначе
		ИмяФайла = "SOKOLMOTORS" + "_" + ПодразделениеКод + "_2_" + ВремяФормирования + ".json";
	КонецЕсли;
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ПутьКФайлу = КаталогВременныхФайлов() + ИмяФайла;
		ЗаписьJSON.ОткрытьФайл(ПутьКФайлу,"UTF-8",,тПараметрыJSON);
		ЗаписатьJSON(ЗаписьJSON, МассивСтруктур);
		ЗаписьJSON.Закрыть();
		СписокФайлов.Добавить(ПутьКФайлу,ИмяФайла);
		Сообщить("Создан файл с данными по ремонту и обслуживанию " + ПутьКФайлу);
	Исключение
		ВыводСообщения = "Ошибка создания файла JSON." + Символы.ПС + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ПолучитьДанныеПоРемонтуОбслуживаниюАвто", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		Сообщить(ВыводСообщения);
	КонецПопытки;
		
КонецПроцедуры

Процедура ПолучитьДанныеПродажиАвто(Подразделение, ДляAutoru = Ложь)	
	МассивСтруктур = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК ВИН,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК НомерДокумента,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаСобытия,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.Марка КАК Марка,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.НаименованиеМодели_Аш_Промис КАК Модель_Аш_Промис,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
	               |	ПРЕДСТАВЛЕНИЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.Цвет) КАК Цвет,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Привод КАК Привод,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.МощностьДвигателя КАК МощностьДвигателя,
	               |	ВЫБОР
	               |		КОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.ОбъемДвигателя = 0
	               |			ТОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя
	               |		ИНАЧЕ РеализацияАвтомобилейАвтомобили.Автомобиль.ОбъемДвигателя
	               |	КОНЕЦ КАК ОбъемДвигателя,
	               |	ВЫБОР
	               |		КОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.ТипКПП <> ЗНАЧЕНИЕ(Справочник.ТипыКПП.ПустаяСсылка)
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.ТипКПП)
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации.ТипКПП)
	               |	КОНЕЦ КАК ТипКПП,
	               |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.ТипДвигателя.ТипТоплива), ПРЕДСТАВЛЕНИЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива)) КАК ТипДвигателя,
	               |	ВЫБОР
	               |		КОГДА РеализацияАвтомобилейАвтомобили.Автомобиль.ГодВыпуска <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ГОД(РеализацияАвтомобилейАвтомобили.Автомобиль.ГодВыпуска)
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ КАК ГодВыпуска
	               |ИЗ
	               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	               |ГДЕ
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
	               |	И НЕ(РеализацияАвтомобилейАвтомобили.Автомобиль.VIN ПОДОБНО ""I%""
	               |				ИЛИ РеализацияАвтомобилейАвтомобили.Автомобиль.VIN ПОДОБНО ""O%""
	               |				ИЛИ РеализацияАвтомобилейАвтомобили.Автомобиль.VIN ПОДОБНО ""Q%"")
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСобытия";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ГруппаПодразделений", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураВозврата = Новый Структура;
		
		ГодСобытия = Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy");
		ИдСобытия = ГодСобытия + "_" + ВыборкаДетальныеЗаписи.НомерДокумента;
		СтруктураВозврата.Вставить("id",ИдСобытия);
		СтруктураВозврата.Вставить("et",1);
		СтруктураВозврата.Вставить("v",ВыборкаДетальныеЗаписи.ВИН);
		СтруктураВозврата.Вставить("dt",Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy-MM-dd"));
		СтруктураВозврата.Вставить("er","Ростовская область");
		Если СтруктураLocation <> Неопределено Тогда
			СтруктураВозврата.Вставить("location",СтруктураLocation);
		КонецЕсли;

		СтруктураВозврата.Вставить("ec", Город);
		
		Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ВыборкаДетальныеЗаписи.Автомобиль,
		Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ВыборкаДетальныеЗаписи.ДатаСобытия);
		
		СтруктураВозврата.Вставить("m", ?(Пробег=Неопределено,0,Пробег));
		
		////Далее все необязательные, передаем null  //В 1С null передавать нельзя , выдает ошибку
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Марка) Тогда
			СтруктураВозврата.Вставить("cbrand",ТРег(ВыборкаДетальныеЗаписи.Марка));
		Иначе
			СтруктураВозврата.Вставить("cbrand","");
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Модель_Аш_Промис) Тогда
			СтруктураВозврата.Вставить("cmodel",ВыборкаДетальныеЗаписи.Модель_Аш_Промис);
		Иначе
			СтруктураВозврата.Вставить("cmodel","");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВариантКомплектации) Тогда
			СтруктураВозврата.Вставить("cdetails",СокрЛП(ВыборкаДетальныеЗаписи.ВариантКомплектации));	
		КонецЕсли;

		//СтруктураВозврата.Вставить("cdescr",null);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГодВыпуска) Тогда
			СтруктураВозврата.Вставить("y",ВыборкаДетальныеЗаписи.ГодВыпуска);
		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОбъемДвигателя) Тогда
			ОбъемДвигателя = ВыборкаДетальныеЗаписи.ОбъемДвигателя;
			Если ВыборкаДетальныеЗаписи.ОбъемДвигателя < 10 Тогда
				ОбъемДвигателя = ОбъемДвигателя*1000;
			КонецЕсли;
			СтруктураВозврата.Вставить("cengs",ОбъемДвигателя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МощностьДвигателя) Тогда
			СтруктураВозврата.Вставить("chp",ВыборкаДетальныеЗаписи.МощностьДвигателя);  
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДвигателя) Тогда
			ТипДвигателя = "";
			Если ВыборкаДетальныеЗаписи.ТипДвигателя = "Бензин" Тогда
				ТипДвигателя = "petrol";
			ИначеЕсли ВыборкаДетальныеЗаписи.ТипДвигателя = "Дизельное топливо" Тогда
				ТипДвигателя = "diesel";
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипДвигателя) Тогда
				СтруктураВозврата.Вставить("cengt",ТипДвигателя);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цвет) Тогда
		    СтруктураВозврата.Вставить("ccolor",ТРег(ВыборкаДетальныеЗаписи.Цвет));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Привод) Тогда
			Если ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Передний Тогда
				СтруктураВозврата.Вставить("cdrive","front");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Полный Тогда
				СтруктураВозврата.Вставить("cdrive","full");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Задний Тогда
				СтруктураВозврата.Вставить("cdrive","back");
			КонецЕсли;
		КонецЕсли;
		//СтруктураВозврата.Вставить("csw",null);
		//СтруктураВозврата.Вставить("clnttp",null);  //НЕ ПЕРЕДАВАТЬ!
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипКПП) Тогда
			Если ВыборкаДетальныеЗаписи.ТипКПП = "Автомат" Тогда
				СтруктураВозврата.Вставить("ctrans","automatic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Механика" Тогда
				СтруктураВозврата.Вставить("ctrans","manual");
            ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Робот" Тогда
				СтруктураВозврата.Вставить("ctrans","robotic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Вариатор" Тогда
				СтруктураВозврата.Вставить("ctrans","variator");
			КонецЕсли;
		КонецЕсли;
		//СтруктураВозврата.Вставить("amnt",null); //НЕ ПЕРЕДАВАТЬ!
		//СтруктураВозврата.Вставить("iscrdt",null); //НЕ ПЕРЕДАВАТЬ!

		//СтруктураВозврата.Вставить("isn",null);
		
		//	ЗаписатьJSON(ЗаписьJSON,СтруктураВозврата);
		
		МассивСтруктур.Добавить(СтруктураВозврата);
		
	КонецЦикла;
	
	ВремяФормирования = Формат(ТекущаяДата(),"ДФ=ггггММдд-ЧЧммсс");	
	ПодразделениеКод = смсКоммуникатор.Транслитерация(Подразделение.Код);	
	Если ДляAutoru Тогда
		ИмяФайла = ПодразделениеКод + "_1_" + ВремяФормирования + ".json";
	Иначе
		ИмяФайла = "SOKOLMOTORS" + "_" + ПодразделениеКод + "_1_" + ВремяФормирования + ".json";
	КонецЕсли;
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ПутьКФайлу = КаталогВременныхФайлов() + ИмяФайла; 
		ЗаписьJSON.ОткрытьФайл(ПутьКФайлу,"UTF-8",,тПараметрыJSON);
		ЗаписатьJSON(ЗаписьJSON, МассивСтруктур);
		ЗаписьJSON.Закрыть();
		СписокФайлов.Добавить(ПутьКФайлу,ИмяФайла);
		Сообщить("Создан файл с данными по продажам авто " + ПутьКФайлу);
	Исключение
		ВыводСообщения = "Ошибка создания файла JSON." + Символы.ПС + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ПолучитьДанныеПродажиАвто", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура ПолучитьДанныеПоУстановкеДопОборудования(Подразделение, ДляAutoru = Ложь)	
	МассивСтруктур = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ГруппаПодразделений", Подразделение);
	Запрос.УстановитьПараметр("СостояниеЗакрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	//Бондаренко++ 20210524
	//Запрос.УстановитьПараметр("ВидРемонтаДопОборудование",Справочники.ВидыРемонта.ДополнительноеОборудование);
	СЗ_ВидовРемонта = Новый СписокЗначений;
	СЗ_ВидовРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	СЗ_ВидовРемонта.Добавить(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером);
	Запрос.УстановитьПараметр("ВидРемонтаДопОборудование",СЗ_ВидовРемонта);
	//Бондаренко-- 20210524
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка,
	               |	ЗаказНаряд.Дата КАК ДатаСобытия,
	               |	ЗаказНаряд.Номер КАК НомерДокумента,
	               |	ЗаказНаряд.Автомобиль,
	               |	ЗаказНаряд.Автомобиль.Модель.Марка КАК Марка,
	               |	ЗаказНаряд.Автомобиль.Модель.НаименованиеМодели_Аш_Промис КАК Модель_Аш_Промис,
	               |	ЗаказНаряд.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
	               |	ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.Цвет) КАК Цвет,
	               |	ЗаказНаряд.Автомобиль.Привод КАК Привод,
	               |	ЗаказНаряд.Автомобиль.МощностьДвигателя КАК МощностьДвигателя,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.Автомобиль.ОбъемДвигателя = 0
	               |			ТОГДА ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя
	               |		ИНАЧЕ ЗаказНаряд.Автомобиль.ОбъемДвигателя
	               |	КОНЕЦ КАК ОбъемДвигателя,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.Автомобиль.ТипКПП <> ЗНАЧЕНИЕ(Справочник.ТипыКПП.ПустаяСсылка)
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ТипКПП)
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипКПП)
	               |	КОНЕЦ КАК ТипКПП,
	               |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ТипДвигателя.ТипТоплива), ПРЕДСТАВЛЕНИЕ(ЗаказНаряд.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива)) КАК ТипДвигателя,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.Автомобиль.ГодВыпуска <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ГОД(ЗаказНаряд.Автомобиль.ГодВыпуска)
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ КАК ГодВыпуска,
	               |	ЗаказНаряд.Автомобиль.VIN КАК ВИН,
	               |	ЗаказНаряд.Пробег,
	               |	ЗаказНаряд.ПричинаОбращения,
	               |	ЗаказНаряд.СервиснаяКампания.Наименование КАК СервиснаяКампания
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЗаказНаряд.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
	               |	И ЗаказНаряд.Состояние = &СостояниеЗакрыт
	               |	И НЕ(ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""I%""
	               |				ИЛИ ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""O%""
	               |				ИЛИ ЗаказНаряд.Автомобиль.VIN ПОДОБНО ""Q%"")
	               |	И ЗаказНаряд.ВидРемонта В(&ВидРемонтаДопОборудование)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказНаряд.Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураВозврата = Новый Структура;
		
		ГодСобытия = Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy");
		ИдСобытия = ГодСобытия + "_" + ВыборкаДетальныеЗаписи.НомерДокумента;
		СтруктураВозврата.Вставить("id",ИдСобытия);
		СтруктураВозврата.Вставить("et",3);
		СтруктураВозврата.Вставить("v",ВыборкаДетальныеЗаписи.ВИН);
		СтруктураВозврата.Вставить("dt",Формат(ВыборкаДетальныеЗаписи.ДатаСобытия,"ДФ=yyyy-MM-dd"));
		СтруктураВозврата.Вставить("er","Ростовская область");
		Если СтруктураLocation <> Неопределено Тогда
			СтруктураВозврата.Вставить("location",СтруктураLocation);
		КонецЕсли;

		СтруктураВозврата.Вставить("ec", Город);
		СтруктураВозврата.Вставить("m", ВыборкаДетальныеЗаписи.Пробег);
		
		////Далее все необязательные, передаем null  //В 1С null передавать нельзя , выдает ошибку
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Марка) Тогда
			СтруктураВозврата.Вставить("cbrand",ТРег(ВыборкаДетальныеЗаписи.Марка));
		Иначе
			СтруктураВозврата.Вставить("cbrand","");
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Модель_Аш_Промис) Тогда
			СтруктураВозврата.Вставить("cmodel",ВыборкаДетальныеЗаписи.Модель_Аш_Промис);
		Иначе
			СтруктураВозврата.Вставить("cmodel","");
		КонецЕсли;

		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВариантКомплектации) Тогда
			СтруктураВозврата.Вставить("cdetails",СокрЛП(ВыборкаДетальныеЗаписи.ВариантКомплектации));	
		КонецЕсли;

		//СтруктураВозврата.Вставить("cdescr",null);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГодВыпуска) Тогда
			СтруктураВозврата.Вставить("y",ВыборкаДетальныеЗаписи.ГодВыпуска);
		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОбъемДвигателя) Тогда
			ОбъемДвигателя = ВыборкаДетальныеЗаписи.ОбъемДвигателя;
			Если ВыборкаДетальныеЗаписи.ОбъемДвигателя < 10 Тогда
				ОбъемДвигателя = ОбъемДвигателя*1000;
			КонецЕсли;
			СтруктураВозврата.Вставить("cengs",ОбъемДвигателя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МощностьДвигателя) Тогда
			СтруктураВозврата.Вставить("chp",ВыборкаДетальныеЗаписи.МощностьДвигателя);  
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДвигателя) Тогда
			ТипДвигателя = "";
			Если ВыборкаДетальныеЗаписи.ТипДвигателя = "Бензин" Тогда
				ТипДвигателя = "petrol";
			ИначеЕсли ВыборкаДетальныеЗаписи.ТипДвигателя = "Дизельное топливо" Тогда
				ТипДвигателя = "diesel";
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипДвигателя) Тогда
				СтруктураВозврата.Вставить("cengt",ТипДвигателя);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цвет) Тогда
		    СтруктураВозврата.Вставить("ccolor",ТРег(ВыборкаДетальныеЗаписи.Цвет));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Привод) Тогда
			Если ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Передний Тогда
				СтруктураВозврата.Вставить("cdrive","front");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Полный Тогда
				СтруктураВозврата.Вставить("cdrive","full");
			ИначеЕсли ВыборкаДетальныеЗаписи.Привод = Перечисления.Привод.Задний Тогда
				СтруктураВозврата.Вставить("cdrive","back");
			КонецЕсли;
		КонецЕсли;
		//СтруктураВозврата.Вставить("csw",null);
		//СтруктураВозврата.Вставить("clnttp",null);  //НЕ ПЕРЕДАВАТЬ!
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипКПП) Тогда
			Если ВыборкаДетальныеЗаписи.ТипКПП = "Автомат" Тогда
				СтруктураВозврата.Вставить("ctrans","automatic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Механика" Тогда
				СтруктураВозврата.Вставить("ctrans","manual");
            ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Робот" Тогда
				СтруктураВозврата.Вставить("ctrans","robotic");
			ИначеЕсли  ВыборкаДетальныеЗаписи.ТипКПП = "Вариатор" Тогда
				СтруктураВозврата.Вставить("ctrans","variator");
			КонецЕсли;
		КонецЕсли;

		//СтруктураВозврата.Вставить("amnt",null); //НЕ ПЕРЕДАВАТЬ!
	
		ОписаниеРабот = "";
		
		Для Каждого стр Из ВыборкаДетальныеЗаписи.Ссылка.Работы Цикл
			ВыполненнаяРабота = стр.Работа.НаименованиеПолное;
			ОписаниеРабот = ОписаниеРабот + ВыполненнаяРабота + "; ";
		КонецЦикла;
		
		СтруктураВозврата.Вставить("det",ОписаниеРабот);
		
		МассивСтруктур.Добавить(СтруктураВозврата);
		
	КонецЦикла;
	
	ВремяФормирования = Формат(ТекущаяДата(),"ДФ=ггггММдд-ЧЧммсс");
	ПодразделениеКод = смсКоммуникатор.Транслитерация(Подразделение.Код);
	Если ДляAutoru Тогда
		ИмяФайла = ПодразделениеКод + "_3_" + ВремяФормирования + ".json";
	Иначе
		ИмяФайла = "SOKOLMOTORS" + "_" + ПодразделениеКод + "_3_" + ВремяФормирования + ".json";
	КонецЕсли;
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ПутьКФайлу = КаталогВременныхФайлов() + ИмяФайла;
		ЗаписьJSON.ОткрытьФайл(ПутьКФайлу,"UTF-8",,тПараметрыJSON);
		ЗаписатьJSON(ЗаписьJSON, МассивСтруктур);
		ЗаписьJSON.Закрыть();
		СписокФайлов.Добавить(ПутьКФайлу,ИмяФайла);
		Сообщить("Создан файл с данными по установке доп.оборудования " + ПутьКФайлу);

	Исключение
		ВыводСообщения = "Ошибка создания файла JSON." + Символы.ПС + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ПолучитьДанныеПоУстановкеДопОборудования", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьДанныеПоДиагностике()
КонецФункции

Функция ПолучитьСтруктуруLocation(Подразделение)
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Код = смсКоммуникатор.Транслитерация(Подразделение.Код);
		СтруктураВозврата = Новый Структура("id, name", Код, Подразделение.Наименование);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВыгрузитьДанныеДляAutoru(Подразделение, ЭтоРегЗадание)
	Город = ПолучитьГородПодразделения(Подразделение);	
	Если НЕ ЗначениеЗаполнено(Город) Тогда
		ВыводСообщения = "Не удалось получить город подразделения " + Подразделение.Наименование + "!";
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ПолучитьГородПодразделения", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураLocation = ПолучитьСтруктуруLocation(Подразделение);
	
	СписокФайлов.Очистить();
	ПолучитьДанныеПродажиАвто(Подразделение, Истина);
	ПолучитьДанныеПоРемонтуОбслуживаниюАвто(Подразделение, Истина);
	ПолучитьДанныеПоУстановкеДопОборудования(Подразделение, Истина);
	
	Если СписокФайлов.Количество() = 0 Тогда
		ВыводСообщения = "Отсутствуют файлы для отправки (" + Подразделение.Наименование + ")!";
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Предупреждение, , ,ВыводСообщения);
		Возврат;
	КонецЕсли;
	
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
	АдресЭлПочты = "sokolmotors-A29yH@partner-main.autoru.tv";
	//АдресЭлПочты = "semenikhin_i@sokolmotors.ru";
	СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
	СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
	СтрокаПолучатели.Представление = АдресЭлПочты;
	СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
    ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
	
	ТекущаяДата = ТекущаяДата();	
	ЭлПисьмо.Тема = "Данные по ГК Соколмоторс от " + Формат(ТекущаяДата, "ДЛФ=ДД");
	ЭлПисьмо.ТекстПисьма= "";
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;

	// добавить вложения
	Для Каждого ЭлементСписка Из СписокФайлов Цикл
		Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			Попытка
				ДвДанные = Новый ДвоичныеДанные(ЭлементСписка.Значение);
				ВыбранныйФайл = Новый Файл(ЭлементСписка.Значение);
				ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
				ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанные);
				ФайлВложение.Размер = ВыбранныйФайл.Размер();
				ФайлВложение.Имя = ВыбранныйФайл.Имя;
				ЭлПисьмо.ЕстьВложения = Истина;
			Исключение
				ВыводСообщения = "Ошибка формирования e-mail (" + Подразделение.Наименование + "): " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
				#Если Клиент Тогда
				Сообщить(ВыводСообщения, СтатусСообщения.Внимание);
				#КонецЕсли
				Продолжить;
			КонецПопытки;		
			
		Иначе
			ВыводСообщения = "Ошибка формирования e-mail (" + Подразделение.Наименование + "): пустое имя файла!";
			ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
			#Если Клиент Тогда
			Сообщить(ВыводСообщения, СтатусСообщения.Внимание);
			#КонецЕсли
			Продолжить;
		КонецЕсли;
	КонецЦикла;
		
	ЭлПисьмо.ОтправительПредставление = "ГК Соколмоторс <1c@sokolmotors.ru>";	
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
	ЭлПисьмо.ДатаОтправления = ТекущаяДата;
	ЭлПисьмо.Дата = ТекущаяДата;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
	ЭлПисьмо.Записать();
	
	// отправить письмо
	Попытка	
		СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
		СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
		Если СоединениеСПочтовымСервером <> Неопределено Тогда
			эпОтправитьПисьмо(ЭлПисьмо, СоединениеСПочтовымСервером);
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		КонецЕсли;

	Исключение
		Если СоединениеСПочтовымСервером <> Неопределено Тогда
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		КонецЕсли;
		ВыводСообщения = "Ошибка при отправке по e-mail (" + Подразделение.Наименование + "): " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ВыгрузкаВАвтотеку.ВыполнитьОбработку", УровеньЖурналаРегистрации.Ошибка, , ,ВыводСообщения);
		#Если Клиент Тогда
		Сообщить(ВыводСообщения, СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
	Для Каждого ИмяВремФайла Из СписокФайлов Цикл
		Файл = Новый Файл(ИмяВремФайла.Значение);
		Если Файл.Существует() Тогда
			Попытка
				УдалитьФайлы(ИмяВремФайла.Значение);
			Исключение
			КонецПопытки;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция НазваниеПартнераAutoru(Подразделение)
	Возврат смсКоммуникатор.Транслитерация(СтрЗаменить(Подразделение.Наименование, " ", ""));
КонецФункции;

///////////////////////////////////////////////////////////
// Исполняемая часть

СписокФайлов = Новый СписокЗначений;
